{
    "Formacao": {
        "titulo": "Formação Acadêmica",
        "formacoes": [
            {
                "nomeDaEscola": "Step Computer Academy",
                "nomeDaFormacao": "Desenvolvimento de Software",
                "descricaoDaEscola": "A Step Computer Academy oferece uma formação sólida e prática em desenvolvimento de software, focando nas mais recentes tecnologias e metodologias de mercado.",
                "linkDaEscola" : "https://itstep.com.br/"
            },
            {
                "nomeDaEscola": "Estácio de Sá",
                "nomeDaFormacao": "Engenharia de Software",
                "descricaoDaEscola": "O curso de Engenharia de Software da Estácio de Sá abrange desde fundamentos de programação até o design e gestão de sistemas complexos.",
                "linkDaEscola" : "https://estacio.br/"
            }    
        ]
    },
    "Qualificacao" : {
        "titulo" : "Qualificação",
        "linguagens": [
            {
                "nome": "Java",
                "imagem": "./Academico-img/java.png"
            },
            {
                "nome": "Python",
                "imagem": "./Academico-img/python.png"
            },
            {
                "nome": "PHP",
                "imagem": "./Academico-img/php.png"
            },
            {
                "nome": "TypeScript",
                "imagem": "./Academico-img/typescript.png"
            }
        ]    
    },
    "Experiencia" : {
        "titulo" : "Experiência",
        "experiencias" : [
            {
                "nome": "Estágio em Desenvolvimento Full Stack",
                "data": "Janeiro 2023 - Julho 2023",
                "objetivo": "Participar do desenvolvimento de aplicações web utilizando React no front-end e Node.js no back-end, colaborando em um projeto de gerenciamento de tarefas."
            },
            {
                "nome": "Desenvolvedor Júnior na Empresa XYZ",
                "data": "Agosto 2023 - Presente",
                "objetivo": "Contribuir no desenvolvimento e manutenção de plataformas e-commerce, implementando melhorias de performance e novas funcionalidades utilizando tecnologias como JavaScript, TypeScript, e MongoDB."
            },
            {
                "nome": "Projeto Pessoal - Portfólio de Desenvolvimento",
                "data": "Março 2023 - Presente",
                "objetivo": "Criar um portfólio online para demonstrar habilidades em desenvolvimento web, utilizando HTML, CSS, JavaScript, e frameworks como React e Express."
            }
        ]
    },
    "Atividade" : {
        "titulo": "Atividade Extracorricula",
        "atividades": [
            "Voluntariado em ONG local, ajudando na organização de eventos",
            "Participação em clubes de tecnologia da escola, promovendo workshops sobre programação",
            "Competição em hackathons, desenvolvendo projetos em equipe com foco em inovação",
            "Assistência a conferências de tecnologia, aprendendo sobre novas tendências do setor"
        ]
    },
    "Curso" : {
        "titulo" : "Curso e Palestra",
        "cursos" : [
            {
                "nome" : "Desenvolvimento Full Stack Web",
                "descricao" : "Abrange tecnologias como HTML, CSS, JavaScript (ES6+), React, Node.js, Express, MongoDB e MySQL. Envolvendo projetos práticos para criação de aplicações completas com front-end e back-end integrados."
            },
            {
                "nome" : "Desenvolvimento Full Stack com MERN Stack (MongoDB, Express, React, Node.js)",
                "descricao" : "Enfatiza o uso da stack MERN para criar aplicações dinâmicas, incluindo autenticação, roteamento e CRUD com bancos de dados NoSQL (MongoDB)."
            },
            {
                "nome" : "Full Stack com TypeScript e Node.js",
                "descricao" : "Cobertura de JavaScript e TypeScript no desenvolvimento web. Utiliza Node.js e Express para back-end, e React com TypeScript para front-end, criando interfaces seguras e escaláveis."
            },
            {
                "nome" : "DevOps e Full Stack Development",
                "descricao" : "Curso que integra desenvolvimento Full Stack com práticas de DevOps, abordando automação de deploy, CI/CD, contêineres com Docker, além de boas práticas de desenvolvimento."
            }, 
            {
                "nome" : "Aplicações Full Stack com Java e Spring Boot",
                "descricao" : "Desenvolvimento back-end com Java e Spring Boot, criando APIs RESTful robustas e seguras, além da integração com front-end usando React ou Angular."
            },
            {
                "nome": "Desenvolvimento Full Stack com Python e Django",
                "descricao": "Focado no desenvolvimento de aplicações web completas utilizando Python e Django no back-end, além de integração com front-end utilizando React ou Vue.js. O curso inclui conceitos de segurança, autenticação, e deploy em nuvem."
            }
        ]
    },
    "Palestra" : {
        "palestras" : [
            {
                "nome": "Palestra com Putin - Moscow",
                "descricao": "Discussão sobre a política global e seu impacto na tecnologia e inovação."
            },
            {
                "nome": "Desenvolvimento Sustentável na Era Digital",
                "descricao": "Análise de como a tecnologia pode ajudar na sustentabilidade e proteção ambiental."
            },
            {
                "nome": "Futuro da Tecnologia: IA e Aprendizado de Máquina",
                "descricao": "Exploração das tendências emergentes em inteligência artificial e suas aplicações práticas."
            },
            {
                "nome": "Inovação e Criatividade no Desenvolvimento de Software",
                "descricao": "Estudo de casos sobre empresas que utilizam práticas inovadoras no desenvolvimento de software."
            },
            {
                "nome": "Transformação Digital em Empresas Tradicionais",
                "descricao": "Palestra sobre como empresas estão se adaptando às novas demandas do mercado digital."
            },
            {
                "nome": "Cibersegurança: Protegendo Dados no Mundo Moderno",
                "descricao": "Orientações sobre práticas recomendadas para proteger informações e dados sensíveis."
            },
            {
                "nome": "Tendências de Desenvolvimento Web para 2024",
                "descricao": "Discussão sobre as tecnologias emergentes e práticas no desenvolvimento web."
            },
            {
                "nome": "A Importância da Diversidade em Equipes de Tecnologia",
                "descricao": "Debate sobre como a diversidade contribui para a inovação em equipes de tecnologia."
            }
        ]
    }
}